ryan0813/CometSAMD/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

phl-microsat_comet.name=PHL-Microsat Comet
phl-microsat_comet.vid.0=0x239A
phl-microsat_comet.pid.0=0x800B
phl-microsat_comet.vid.1=0x239A
phl-microsat_comet.pid.1=0x000B
phl-microsat_comet.upload.tool=bossac
phl-microsat_comet.upload.protocol=sam-ba
phl-microsat_comet.upload.maximum_size=262144
phl-microsat_comet.upload.use_1200bps_touch=true
phl-microsat_comet.upload.wait_for_upload_port=true
phl-microsat_comet.upload.native_usb=true
phl-microsat_comet.build.mcu=cortex-m0plus
phl-microsat_comet.build.f_cpu=48000000L
phl-microsat_comet.build.usb_product="Comet"
phl-microsat_comet.build.usb_manufacturer="PHL-Microsat"
phl-microsat_comet.build.board=COMET
phl-microsat_comet.build.core=arduino
phl-microsat_comet.build.extra_flags=-DARDUINO_SAMD_ZERO -D__SAMD21G18A__ {build.usb_flags}
phl-microsat_comet.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
phl-microsat_comet.build.openocdscript=openocd_scripts/arduino_zero.cfg
phl-microsat_comet.build.variant=comet
phl-microsat_comet.build.variant_system_lib=
phl-microsat_comet.build.vid=0x239A
phl-microsat_comet.build.pid=0x800B
phl-microsat_comet.bootloader.tool=openocd
phl-microsat_comet.bootloader.file=feather/samd21_sam_ba.bin

